books = {
    "Преступление и наказание": "Фёдор Достоевский",
    "Война и мир": "Лев Толстой",
    "Мастер и Маргарита": "Михаил Булгаков",
    "1984": "Джордж Оруэлл",
    "Гордость и предубеждение": "Джейн Остин",
    "Сто лет одиночества": "Габриэль Гарсиа Маркес",
    "Улисс": "Джеймс Джойс",
    "Бесы": "Фёдор Достоевский",
    "Анна Каренина": "Лев Толстой",
    "Скотный двор": "Джордж Оруэлл",
    "Разум и чувства": "Джейн Остин",
    "Идиот": "Фёдор Достоевский",
    "Собачье сердце": "Михаил Булгаков",
    "Повелитель мух": "Уильям Голдинг",
    "Лолита": "Владимир Набоков"
}

all_books = list(books.keys())
all_uniq_authors = set(list(books.values()))
print(all_books)
print(all_uniq_authors)
